/**
Царю Небесний, Утешителю, Дух на Истината,
който си навсякъде и всичко изпълваш,
дойди и се всели в нас, очисти ни от всяка сквернота,
и спаси, благии, нашите души!

Свети Боже, Свети Крепки, Свети Безсмъртни,
помилуй нас,
Свети Боже, Свети Крепки, Свети Безсмъртни,
помилуй нас,
Свети Боже, Свети Крепки, Свети Безсмъртни,
помилуй нас.

Слава на Отца и Сина и Светия Дух,
и сега, и винаги и вовеки веков. Амин.

Пресвета Троице, помилуй нас, Господи, очисти греховете ни,
Владико, прости беззаконията ни,
Свети, посети и изцери немощите ни, заради твоето Име.

Господи помилуй, Господи помилуй, Господи помилуй.

Слава на Отца и Сина и Светия Дух,
и сега, и винаги, и вовеки веков. Амин.

Отче наш, който си на небесата, да се свети Твоето Име,
да дойде Твоето Царство, да бъде Твоята Воля,
както на небето, така и на земята. Насъщния ни хляб дай ни днес,
и прости нам дълговете, както и ние прощаваме на нашите длъжници.
И не въведи нас в изкушение, но избави ни от лукавия.

Защото Твое е царството, и силата, и славата на Отца, и Сина,
и Светия Дух, и сега и винаги и вовеки веков. Амин.

---
Господи, Иисусе Христе, Сине Божий, помилуй ме грешния.
Пресвята Владичице, Богородице, спаси нас.
**/

#include <stdlib.h>
#include "include/jc_get_pascha_vlevitskim.h"

/**
 Table.
**/
typedef int JDN;
typedef struct {
 int day, month;
} MD;

static MD G[19] = {
{12,4},{29,3},{19,4},{5,4},{29,3},{12,4},{5,4},{19,4},{12,4},{29,3},
{19,4},{5,4},{29,3},{19,4},{5,4},{22,3},{12,4},{5,4},{19,4}
};
static int _gr[] = {5,11,16,22};

static MD B[19] = {
 {6,4},{30,3},{20,4},{6,4},{23,3},{13,4},{6,4},{20,4},{13,4},{30,3},
{20,4},{6,4},{30,3},{13,4},{6,4},{23,3},{13,4},{30,3},{20,4}
};
static int _br[] = {4,10,21,27};

static MD A[19] = {
{7,4},{31,3},{14,4},{7,4},{24,3},{14,4},{31,3},{21,4},{14,4},{31,3},
{21,4},{7,4},{31,3},{14,4},{7,4},{24,3},{14,4},{31,3},{21,4}
};
static int _ar[] = {9,15,20,26};

static MD Z[19] = {
{8,4},{1,4},{15,4},{8,4},{25,3},{15,4},{1,4},{22,4},{8,4},{1,4},
{22,4},{8,4},{25,3},{15,4},{8,4},{25,3},{15,4},{1,4},{22,4},
};
static int _zr[] = {3,8,14,25};

static MD S[19] = {
{9,4},{26,3},{16,4},{9,4},{26,3},{16,4},{2,4},{23,4},{9,4},{2,4},
{16,4},{9,4},{26,3},{16,4},{2,4},{26,3},{16,4},{2,4},{23,4}
};
static int _sr[] = {2,13,19,24};

static MD E[19] = {
{10,4},{27,3},{17,4},{3,4},{27,3},{17,4},{3,4},{24,4},{10,4},{3,4},
{17,4},{10,4},{27,3},{17,4},{3,4},{27,3},{10,4},{3,4},{24,4},
};
static int _er[] = {1,7,12,18};

static MD D[19] = {
{11,4},{28,3},{18,4},{4,4},{28,3},{11,4},{4,4},{25,4},{11,4},{28,3},
{18,4},{11,4},{28,3},{18,4},{4,4},{28,3},{11,4},{4,4},{18,4},
};
static int _dr[] = {0,6,17,23};

static int compareushort (const void* a, const void* b) {
 int r = ( *(int*)a - *(int*)b );
/**
#ifdef DBG
 printf("%d comparedto %d returns %d\r\n", *(int*)a, *(int*)b, r);
#endif
**/
 return r;
}

YMD jc_get_pascha_vlevitskim(const YEAR_NUM year) {
	/** Ref: http://alebedev.narod.ru/tab/tab11.html **/
	int rm = (int) (year % 28);

	int *pItem;
	MD *md;
	       if(NULL != bsearch(&rm, _gr, 4, sizeof(int), compareushort)) {
		md = G;
	} else if(NULL != bsearch(&rm, _br, 4, sizeof(int), compareushort)) {
		md = B;
	} else if(NULL != bsearch(&rm, _ar, 4, sizeof(int), compareushort)) {
		md = A;
	} else if(NULL != bsearch(&rm, _zr, 4, sizeof(int), compareushort)) {
		md = Z;
	} else if(NULL != bsearch(&rm, _sr, 4, sizeof(int), compareushort)) {
		md = S;
	} else if(NULL != bsearch(&rm, _er, 4, sizeof(int), compareushort)) {
		md = E;
	} else if(NULL != bsearch(&rm, _dr, 4, sizeof(int), compareushort)) {
		md = D;
	} else {
		md = NULL;
	}

	if (md) {
		int rl = year%19;


	MD m = md[rl];

	YMD r = {year,m.month,m.day};
	return r;
	} else {
	return (YMD) {0,0,0};
	}
}
