/**
Царю Небесний, Утешителю, Дух на Истината,
който си навсякъде и всичко изпълваш,
дойди и се всели в нас, очисти ни от всяка сквернота,
и спаси, благии, нашите души!

Свети Боже, Свети Крепки, Свети Безсмъртни,
помилуй нас,
Свети Боже, Свети Крепки, Свети Безсмъртни,
помилуй нас,
Свети Боже, Свети Крепки, Свети Безсмъртни,
помилуй нас.

Слава на Отца и Сина и Светия Дух,
и сега, и винаги и вовеки веков. Амин.

Пресвета Троице, помилуй нас, Господи, очисти греховете ни,
Владико, прости беззаконията ни,
Свети, посети и изцери немощите ни, заради твоето Име.

Господи помилуй, Господи помилуй, Господи помилуй.

Слава на Отца и Сина и Светия Дух,
и сега, и винаги, и вовеки веков. Амин.

Отче наш, който си на небесата, да се свети Твоето Име,
да дойде Твоето Царство, да бъде Твоята Воля,
както на небето, така и на земята. Насъщния ни хляб дай ни днес,
и прости нам дълговете, както и ние прощаваме на нашите длъжници.
И не въведи нас в изкушение, но избави ни от лукавия.

Защото Твое е царството, и силата, и славата на Отца, и Сина,
и Светия Дух, и сега и винаги и вовеки веков. Амин.

---
Господи, Иисусе Христе, Сине Божий, помилуй ме грешния.
Пресвята Владичице, Богородице, спаси нас.
**/

#include <stdlib.h>
#include "include/jc_get_pascha_dveri.h"

YMD jc_get_pascha_dveri(const YEAR_NUM year) {
	/** Ref: http://synpress-classic.dveri.bg/pasha/index.htm **/
	/**
		Year - номер на годината
		a = Year mod 19
		b = Year mod 4
		c = Year mod 7
		d = (19 * a + 15) mod 30
		e = (2 * b + 4 * c + 6 * d + 6) mod 7,

		Ако (d + e) > 10, то Пасхата по стар стил ще бъде (d + e - 9) април, в противен случай - (22 + d + e) март 
	**/
	int a = year%19, b = year%4, c=year%7, d=(19*a +15) % 30, e = (2*b + 4*c + 6*d + 6) % 7;
	YMD r;
	r.year = year;
	if (10 <= (d + e)) {
		r.month = 4;
		r.day = d+e-9;
	} else {
		r.month = 3;
		r.day = 22+d+e;
	}
	return r;
}